# Tutorial 5: Indexado-Selección-Filtrado en Pandas
Aquí veremos como hacer estas operaciones tanto en series como dataframes

In [1]:
import pandas
import numpy

In [2]:
serie = pandas.Series(numpy.arange(5),
                     index=["a","b","c","d","e"]
                     )

In [10]:
serie["a":"c"] # rango también vale[0:3]

a    0
b    1
c    2
dtype: int32

In [13]:
serie[serie>2]

d    3
e    4
dtype: int32

## Indexado en DataFrames

In [14]:
dataframe = pandas.DataFrame(
    numpy.arange(16).reshape(4,4),
    index=["Londres","Paris","Berlin","Madrid"],
    columns=["uno","dos","tres","cuatro"]
)
dataframe

         uno  dos  tres  cuatro
Londres    0    1     2       3
Paris      4    5     6       7
Berlin     8    9    10      11
Madrid    12   13    14      15

In [31]:
dataframe["dos"] # Por columna

Londres    1
Paris      5
Berlin     3
Madrid     3
Name: dos, dtype: int32

In [22]:
dataframe[:3] # Todas las columnas y todas las filas menos la última

         uno  dos  tres  cuatro
Londres    0    1     2       3
Paris      4    5     6       7
Berlin     8    9    10      11

In [23]:
dataframe[dataframe["cuatro"]>5] # Las filas que tengan el valor de cuatro mayor que 5

# Equivalente a Select * from dataset where cuatro > 5

        uno  dos  tres  cuatro
Paris     4    5     6       7
Berlin    8    9    10      11
Madrid   12   13    14      15

In [26]:
dataframe[dataframe>5] = 3 # Cambiar el valor según la condición
dataframe

# Parecido a update dataset set val = 3 where val > 5

         uno  dos  tres  cuatro
Londres    0    1     2       3
Paris      4    5     3       3
Berlin     3    3     3       3
Madrid     3    3     3       3

## Select with iloc and loc

* Iloc permite hacer una selección por index numérico
* loc permite hacer selección por index string

In [29]:
dataframe.iloc[1]

uno       4
dos       5
tres      3
cuatro    3
Name: Paris, dtype: int32

In [41]:
dataframe.iloc[1,[1,2,3]] # Selecciona todos los valores menos el primero de la segunda fila

dos       5
tres      3
cuatro    3
Name: Paris, dtype: int32

In [35]:
dataframe.iloc[[1,3],[1,2,3]] # Lo mismo pero para varias filas

        dos  tres  cuatro
Paris     5     3       3
Madrid    3     3       3

In [42]:
dataframe.loc[:"Paris","tres"]

Londres    2
Paris      3
Name: tres, dtype: int32

In [ ]:
ser